In [1]:
import datetime

In [2]:
today_date=datetime.datetime.today()

In [3]:
today_date

datetime.datetime(2021, 2, 9, 21, 32, 5, 146802)

In [4]:
today_date-datetime.timedelta(1)

datetime.datetime(2021, 2, 8, 21, 32, 5, 146802)

In [5]:
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [6]:
days

[datetime.datetime(2021, 2, 9, 21, 32, 5, 146802),
 datetime.datetime(2021, 2, 8, 21, 32, 5, 146802),
 datetime.datetime(2021, 2, 7, 21, 32, 5, 146802),
 datetime.datetime(2021, 2, 6, 21, 32, 5, 146802),
 datetime.datetime(2021, 2, 5, 21, 32, 5, 146802),
 datetime.datetime(2021, 2, 4, 21, 32, 5, 146802),
 datetime.datetime(2021, 2, 3, 21, 32, 5, 146802),
 datetime.datetime(2021, 2, 2, 21, 32, 5, 146802),
 datetime.datetime(2021, 2, 1, 21, 32, 5, 146802),
 datetime.datetime(2021, 1, 31, 21, 32, 5, 146802),
 datetime.datetime(2021, 1, 30, 21, 32, 5, 146802),
 datetime.datetime(2021, 1, 29, 21, 32, 5, 146802),
 datetime.datetime(2021, 1, 28, 21, 32, 5, 146802),
 datetime.datetime(2021, 1, 27, 21, 32, 5, 146802),
 datetime.datetime(2021, 1, 26, 21, 32, 5, 146802)]

In [7]:
data=pd.DataFrame(days)
data.columns=["days"]
data.head()

                        days
0 2021-02-09 21:32:05.146802
1 2021-02-08 21:32:05.146802
2 2021-02-07 21:32:05.146802
3 2021-02-06 21:32:05.146802
4 2021-02-05 21:32:05.146802

In [8]:
data['day_name']=data['days'].dt     .day_name()
data.head()

                        days  day_name
0 2021-02-09 21:32:05.146802   Tuesday
1 2021-02-08 21:32:05.146802    Monday
2 2021-02-07 21:32:05.146802    Sunday
3 2021-02-06 21:32:05.146802  Saturday
4 2021-02-05 21:32:05.146802    Friday

In [9]:
data['days'].dt.hour # minute day year month

0     21
1     21
2     21
3     21
4     21
5     21
6     21
7     21
8     21
9     21
10    21
11    21
12    21
13    21
14    21
Name: days, dtype: int64

In [10]:
dictionary={
    'Monday':1,
    'Tuesday':2,
    'Wednesday':3,
    'Thursday':4,
    'Friday':5,
    'Saturday':6,
    'Sunday':7
}

In [11]:
data['day name ordinal']=data['day_name'].map(dictionary)
data.head()

                        days  day_name  day name ordinal
0 2021-02-09 21:32:05.146802   Tuesday                 2
1 2021-02-08 21:32:05.146802    Monday                 1
2 2021-02-07 21:32:05.146802    Sunday                 7
3 2021-02-06 21:32:05.146802  Saturday                 6
4 2021-02-05 21:32:05.146802    Friday                 5

### Count or Frequency Encoding

In [12]:
# train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data',header=None,index_col=None)

In [13]:
# train_set.to_csv('train_set.csv')

In [14]:
train_set=pd.read_csv('train_set.csv')
train_set.head()

,Unnamed: 0,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [15]:
len(train_set['1'].unique())

9

In [16]:
# columns=[1,3,5,6,7,8,9,13]

In [17]:
# train_set=train_set[columns]

In [18]:
# columns=[train_set['1'],train_set['3'],train_set['5'],train_set['6'],train_set['7'],train_set['8'],train_set['9'],train_set['13']]

In [19]:
# train_set=train_set[columns]

In [20]:
train_set.drop(['Unnamed: 0','0','2','4','10','11','12','14'],axis=1,inplace=True)

In [21]:
train_set.shape

(32561, 8)

In [22]:
train_set.columns=['Employment','Degree','Status','Designation','family_job','Race','Sex','country']

In [23]:
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [24]:
for feature in train_set.columns[:]:
    print(feature, ":",len(train_set[feature].unique()) ,'Labels')

Employment : 9 Labels
Degree : 16 Labels
Status : 7 Labels
Designation : 15 Labels
family_job : 6 Labels
Race : 5 Labels
Sex : 2 Labels
country : 42 Labels

In [25]:
country_map=train_set['country'].value_counts().to_dict()

In [26]:
train_set['country']=train_set.country.map(country_map)

In [27]:
train_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

#### Advatages
1. easy to implemet
2. Not increasing feature space
#### Disadvantage
1. it will provide same weight if the frequencies are same

### Target guided ordianal encoding 
1. Ordering the lables according to the target
2. Replace the labels by the joint probability of being 1 or 0

In [28]:
df=pd.read_csv('titanic_train.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [29]:
df['Cabin'].fillna("Missing",inplace=True)

In [30]:
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [31]:
df.Cabin=df.Cabin.astype(str).str[0]

In [32]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [33]:
df['Cabin'].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [34]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [35]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [36]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}

In [37]:
ordinal_labels2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [38]:
df['Cabin_ordinal_labels']=df['Cabin'].map(ordinal_labels2)

In [39]:
df.head()

   Survived Cabin  Cabin_ordinal_labels
0         0     M                     1
1         1     C                     4
2         1     M                     1
3         1     C                     4
4         0     M                     1

### Mean Encoding

In [40]:
ordinal_mean=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [41]:
ordinal_mean

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'M': 0.29985443959243085,
 'T': 0.0}

In [42]:
df['ordinal_mean_encoding']=df['Cabin'].map(ordinal_mean)

In [43]:
df.head()

   Survived Cabin  Cabin_ordinal_labels  ordinal_mean_encoding
0         0     M                     1               0.299854
1         1     C                     4               0.593220
2         1     M                     1               0.299854
3         1     C                     4               0.593220
4         0     M                     1               0.299854

### Probability Ratio Encoding
1. probability of survived based on the Cabin--- Categorical Feature
2. Probability of not survived--- 1-pr(survived)
3. pr(survived)/pr(not survived)
4. Dictionary to map cabin with probability 
5. replace with the categorical feature

In [44]:
df=pd.read_csv('titanic_train.csv',usecols=['Survived','Cabin'])

In [45]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [46]:
df['Cabin'].fillna("Misssing",inplace=True)

In [47]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [48]:
df.head()

   Survived Cabin
0         0     M
1         1     C
2         1     M
3         1     C
4         0     M

In [49]:
prob_df=df.groupby(['Cabin'])['Survived'].mean()

In [50]:
prob_df=pd.DataFrame(prob_df)
prob_df

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
M      0.299854
T      0.000000

In [51]:
prob_df['Died']=1-prob_df['Survived']

In [52]:
prob_df.head()

       Survived      Died
Cabin
A      0.466667  0.533333
B      0.744681  0.255319
C      0.593220  0.406780
D      0.757576  0.242424
E      0.750000  0.250000

In [62]:
prob_df['Probability_ratio']=prob_df['Survived']/prob_df['Died']

Cabin
A    0.875000
B    2.916667
C    1.458333
D    3.125000
E    3.000000
F    1.600000
G    1.000000
M    0.428274
T    0.000000
dtype: float64

In [54]:
prob_df.head()

       Survived      Died  Probability_ratio
Cabin
A      0.466667  0.533333           0.875000
B      0.744681  0.255319           2.916667
C      0.593220  0.406780           1.458333
D      0.757576  0.242424           3.125000
E      0.750000  0.250000           3.000000

In [61]:
probability_encoded=prob_df['Probability_ratio'].to_dict()

In [56]:
df['Cabin_encoded']=df['Cabin'].map(probability_encoded)

In [57]:
df.head()

   Survived Cabin  Cabin_encoded
0         0     M       0.428274
1         1     C       1.458333
2         1     M       0.428274
3         1     C       1.458333
4         0     M       0.428274